The category id.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2011
 Syntax
  C#
public ElementId CategoryId { get; }
  Visual Basic
Public ReadOnly Property CategoryId As ElementId
	Get
  Visual C++
public:
property ElementId^ CategoryId {
	ElementId^ get ();
}
 See Also
  ElementCategoryFilter Class
  Autodesk.Revit.DB Namespace